app/Controllers/Api.php

SELECT *
FROM "menus"
---
    public function getMenus()
    {
        $menus = $this->menusModel->findAll();

SELECT *
FROM "menus"
WHERE "stock" = 'tersedia'
ORDER BY "price" DESC
---
    public function sortPrice(){
        $menus = $this->menusModel->where('stock', 'tersedia')->orderBy('price', 'ASC')->findAll();