app/Controllers/Menu.php

SELECT *
FROM "menus"
---
    public function index()
    {
        $session = session();
        $menus = $this->menusModel->findAll();

SELECT *
FROM "menus"
ORDER BY "stock" ASC
---
        }
        else
        {
            $menus = $this->menusModel->orderBy('stock', 'ASC')->findAll();

SELECT *
FROM `menus`
WHERE `category` = 'makanan'
AND  `name` LIKE '%2%' ESCAPE '!'
SELECT *
FROM `orders`
JOIN `menus` ON `menus`.`name`=`orders`.`menu`
WHERE `category` = 'makanan'
AND  `table` LIKE '%2%' ESCAPE '!'
 LIMIT 1
---
    public function search()
    {
        $session = session();
        $ordersModel = new OrdersModel();
        $search = $this->request->getVar('search');
        $categories = $this->request->getVar('categories');
        // $table = new \CodeIgniter\Views\Table();
        if($search || $categories)
        {
            if($search && $categories)
            {
                $menus = $this->menusModel->where('category', $categories)->like('name', $search)->findAll();
                if($menus)
                {
                    $data =
                    [
                        'session' => $session,
                        'menus' => $menus
                    ];
                    return view('menu/stok', $data);


                }
                else
                {
                    $orders = $ordersModel->join('menus', 'menus.name=orders.menu')->where('category', $categories)->like('table', $search)->findAll();

SELECT *
FROM `menus`
WHERE `name` LIKE '%1%' ESCAPE '!'
---
            {
                if($search)
                {
                    $menus = $this->menusModel->like('name', $search)->findAll();

SELECT *
FROM `orders`
WHERE `table` LIKE '%1%' ESCAPE '!'
 LIMIT 1
---
                    }
                    else
                    {
                        $orders = $ordersModel->like('table',$search)->findAll();

SELECT *
FROM "menus"
WHERE "name" = 'apa aja'
---
    public function store_product(){
        $dataProduct = $this->menusModel->where('name', $this->request->getPost('name_product'))->findAll();