app/Controllers/Order.php

SELECT *
FROM `orders`
---
    public function index()
    {
        $session = session();
        $menusModel = new MenusModel();
        $ordersModel = new OrdersModel();
        $orders = $ordersModel->findAll();

SELECT *
FROM `orders`
WHERE `id` = '1'
 LIMIT 1
SELECT *
FROM `menus`
WHERE `name` = 'Nasi Padang'
 LIMIT 1
---
    public function delete($id = false)
    {
        $session = session();
        if($id)
        {
            $ordersModel = new OrdersModel();
            $menusModel = new MenusModel();
            $orders = $ordersModel->where('id', $id)->first();
            $menus = $menusModel->where('name', $orders['menu'])->first();

DELETE FROM `orders`
WHERE `id` IN ('1')
SELECT *
FROM `orders`
---
            [
                'id' => $orders['id']
            ];
            $ordersModel->delete($data_orders);
        }
        $orders = $ordersModel->findAll();